8-issues.org
* Issues

** 学习时遇到的问题
*** Q: ZooKeeper JMX enabled by default Using config: /Users/wudanyang/self/zoo/bin/../conf/zoo.cfg Error contacting service. It is probably not running.

    A: bin/zkServer.sh start-foreground 可以查看到

*** Q: ZooKeeper 执行 bin/zkServer.sh status 说未启动

    A: ps aux | grep zookeeper
查看是否存在

*** Q: SolrCore Initialization Failures

    A: 未上传配置
    sh zkcli.sh -cmd upconfig -zkhost localhost:2181 -confname gettingstarted -confdir ../../../server/solr/configsets/basic_configs/conf


*** Q: 通过api创建collection时, 返回localhost未返回任何数据

    A: 请求地址应该是solr服务器，而不是zookeeper服务器。
localhost:8983/solr/admin/collectinos?action=CREATE&name=yang&numShards=1&replicationFactor=3&collection.configName=yang


*** Q: Cannot create collection tinycollection. Value of maxShardsPerNode is 1, and the number of live nodes is 4. This allows a maximum of 4 to be created. Value of numShards is 2 and value of replicationFactor is 3. This requires 6 shards to be created (higher than the allowed number)</str>  

    A:将replicationFactor降低
http://localhost:8983/solr/admin/collections?action=CREATE&name=yang&collection.configName=yang&numShards=1&replicationFactor=1&wt=json


*** Q: 在zookeeper中找不到配置文件

    A: 配置文件疑似在上传到zookeeper时放到了名为zoo_data/version-{num}/log.number的二进制文件中


*** Q: 为何在6.*以上的solr中store=false 仍然能看到字段被返回了

    A: 在6.*之后，string 的 docValues=true 为默认值


*** Q: int类型为何docValues=false与stored=false还能在结果中看到字段

    A: 未知


*** Q: 从 example/example-DIH/solr/ 中复制solr.xml 作为cloud的配置文件无法生效 

    A: 因为默认的配置文件里面有 standalone="yes" 及不使用集群方式

*** Q: 为什么找不到 Can't find resource 'schema.xml'

    A: example 文件夹中的配置文件为 managed-schema 需要改成 schema.xml 上传才行

    
** 公司系统发现的问题

   1. 脚本文件处于无版本控制状态
      创建git本地库，后续可以跟运维商量加上一个solr脚本的git库
